import React from 'react'

const Table1 = () => {
  return (
    <div>

      {/* page1 */}

      <pre className='fonts'>
      {/* <pre className='d-none d-print-block fonts'> */}
          <br />                                                                                                                                                                             ไตรมาสที่ 1 <input type="checkbox" /> ต.ค.-ธ.ค. ๖๖
          <br />                                                                                                                                                                             ไตรมาสที่ 2 <input type="checkbox" /> ม.ค.-มี.ค. ๖๗
          <br />                                                                      แบบรายงานความก้าวหน้ารายโครงการ/กิจกรรม                        ไตรมาสที่ 3 <input type="checkbox" /> เม.ย.-มิ.ย. ๖๗
          <br />                                                                                 <b>ส่วนราชการ....................................</b>                                   ไตรมาสที่ 4 <input type="checkbox" /> ก.ค.-ก.ย. ๖๗
          <br />                  ชื่อโครงการ/กิจกรรม.........................................................................................................................................................
          <br />                                                    ..........................................................................................................................................................
          <br />                  ลำดับที่โครงการ/กิจกรรม..............................................(ตามแผน สนพ.)..................................................(ตามแผน รพ.)
          <br />                  <b>หน่วยงานที่รับผิดชอบ</b>
          <br />                  กลุ่มงาน/ผ่าย.....................................................................................................................................................................
          <br />                  เจ้าหน้าที่ผู้รับผิดชอบ.....................................................................................โทรศัพท์......................................................
          <br />                  <b>ผลการดำเนินงาน</b>
          <br />                  สถานะของโครงการ               <input type="checkbox" />         แล้วเสร็จ                     <input type="checkbox" />         ยังไม่เริ่มดำเนินการ               <input type="checkbox" />         ยกเลิก
          <br />                                                                 <input type="checkbox" />         กำลังดำเนินการ          <input type="checkbox" />         ชะลอ
          <br />                  รายละเอียดการดำเนินงานในไตรมาสนี้ บอกถึงเป้าหมาย วัตถุประสงค์ วิธีดำเนินการและผล (ถ้ามี) รวมถึงความก้าวหน้า
          <br />                  ของโครงการ (%)
          <div className='border border-dark mb-2 mt-1 m-5 p-2'>  <b><u>วัตถุประสงค์</u></b>
          <br />          โรงเรียนโสตศึกษาจังหวัดนนทบุรี มีนักเรียนที่บกพร่องทางการได้ยิน และบกพร่องทางสติปัญญานักเรียนส่วนใหญ่
            <br />  เป็นนักเรียนประจำพักอยู่ที่เรือนนอนภายในโรงเรียน ปัญหาที่พบได้บ่อย คือนักเรียนที่เข้าห้องน้ำมักจะลืมปิดน้ำเมื่อใช้
            <br />  แล้วโดยเฉพาะนักเรียนที่มีความบกพร่องทางการได้ยิน จะมีปัญหาในการไม่ได้ยินเสียงน้ำไหล และหากเกิดพฤติกรรมที่
            <br />  ลืมปิดน้ำบ่อยครั้ง จะทำให้ค่าน้ำปะปาของโรงเรียนเพิ่มสูงขึ้นตามมา
            <br />  <b><u>เป้าหมาย</u></b>
            <br />          โรงเรียนโสตศึกษาจังหวัดนนทบุรี มีนักเรียนที่บกพร่องทางการได้ยิน และบกพร่องทางสติปัญญานักเรียนส่วนใหญ่
            <br />  เป็นนักเรียนประจำพักอยู่ที่เรือนนอนภายในโรงเรียน ปัญหาที่พบได้บ่อย คือนักเรียนที่เข้าห้องน้ำมักจะลืมปิดน้ำเมื่อใช้
            <br />  แล้วโดยเฉพาะนักเรียนที่มีความบกพร่องทางการได้ยิน จะมีปัญหาในการไม่ได้ยินเสียงน้ำไหล และหากเกิดพฤติกรรมที่
            <br />  ลืมปิดน้ำบ่อยครั้ง จะทำให้ค่าน้ำปะปาของโรงเรียนเพิ่มสูงขึ้นตามมาด้วย 
            <br />  <b><u>ผลการดำเนินโครงการ</u></b>
            <br />          โรงเรียนโสตศึกษาจังหวัดนนทบุรี มีนักเรียนที่บกพร่องทางการได้ยิน และบกพร่องทางสติปัญญานักเรียนส่วนใหญ่
            <br />  เป็นนักเรียนประจำพักอยู่ที่เรือนนอนภายในโรงเรียน ปัญหาที่พบได้บ่อย คือนักเรียนที่เข้าห้องน้ำมักจะลืมปิดน้ำเมื่อใช้
            <br />  แล้วโดยเฉพาะนักเรียนที่มีความบกพร่องทางการได้ยิน จะมีปัญหาในการไม่ได้ยินเสียงน้ำไหล และหากเกิดพฤติกรรมที่
            <br />  ลืมปิดน้ำบ่อยครั้ง จะทำให้ค่าน้ำปะปาของโรงเรียนเพิ่มสูงขึ้นตามมา
            <br /><table className='table table-bordered border-primary'>
              <thead><tr><th>เดือน</th><th>ค่าที่1</th><th>ค่าที่2</th><th>รวม</th></tr></thead>
              <tbody>
                <tr><th>12</th><th>123</th><th>321</th><th>321</th></tr>
                <tr><th>12</th><th>123</th><th>321</th><th>321</th></tr>
                <tr><th>12</th><th>123</th><th>321</th><th>321</th></tr>
                <tr><th>12</th><th>123</th><th>321</th><th>321</th></tr>
                <tr><th>12</th><th>123</th><th>321</th><th>321</th></tr>
              </tbody>
            </table>  <b>หมายเหตุ</b>
            <br />  ..
            <br />  ..
          </div>
          
          <br />                  <b>การใช้จ่ายงบประมาณ</b>             <input type="checkbox" />         ไม่ได้ใช้งบประมาณ                     <input type="checkbox" />         ใช้งบประมาณ
            <br /><div className='m-5 mt-1 mb-0'><table className='table table-bordered border-primary textc'>
              <thead><tr><th colspan="2">งบประมาณและแหล่งที่มาของ<br />งบประมาณ</th><th colspan="3">งบประมาณที่ใช้ไป<br />ในรอบการรายงานครั้งนี้</th><th colspan="3">งบประมาณที่ใช้ไป<br />ทั้งหมด</th></tr></thead>
              <tbody>
                <tr><th>งบฯกทม.</th><th>งบฯอุดหนุน<br />/อื่นๆ</th><th>งบฯ<br />ดำเนินการ</th><th>งบฯลงทุน</th><th>รวม</th><th>งบฯ<br />ดำเนินการ</th><th>งบฯลงทุน</th><th>รวม</th></tr>
                <tr><th>..</th><th>..</th><th>..</th><th>..</th><th>..</th><th>..</th><th>..</th><th>..</th></tr>
                
              </tbody>
            </table></div>                  <b>สรุปผลการดำเนินงาน</b> ( <input type="checkbox" /> ) เป็นไปตามแผน ( <input type="checkbox" /> ) เป็นไปตามแผนแต่ควรติดตามเป็นพิเศษ ( <input type="checkbox" /> ) ไม่เป็นไปตามแผน
          <br />
          <br />                  <b>ข้อคิดเห็นเพิ่มเติม / ปัญหาและอุปสรรค</b>
          <br />                            โรงเรียนโสตศึกษาจังหวัดนนทบุรี มีนักเรียนที่บกพร่องทางการได้ยิน และบกพร่องทางสติปัญญานักเรียนส่วนใหญ่
            <br />                  เป็นนักเรียนประจำพักอยู่ที่เรือนนอนภายในโรงเรียน ปัญหาที่พบได้บ่อย คือนักเรียนที่เข้าห้องน้ำมักจะลืมปิดน้ำเมื่อใช้
            <br />                  แล้วโดยเฉพาะนักเรียนที่มีความบกพร่องทางการได้ยิน จะมีปัญหาในการไม่ได้ยินเสียงน้ำไหล และหากเกิดพฤติกรรมที่
            <br />                  ลืมปิดน้ำบ่อยครั้ง จะทำให้ค่าน้ำปะปาของโรงเรียนเพิ่มสูงขึ้นตามมา
            <br />                            โรงเรียนโสตศึกษาจังหวัดนนทบุรี มีนักเรียนที่บกพร่องทางการได้ยิน และบกพร่องทางสติปัญญานักเรียนส่วนใหญ่
            <br />                  เป็นนักเรียนประจำพักอยู่ที่เรือนนอนภายในโรงเรียน ปัญหาที่พบได้บ่อย คือนักเรียนที่เข้าห้องน้ำมักจะลืมปิดน้ำเมื่อใช้
            <br />                  แล้วโดยเฉพาะนักเรียนที่มีความบกพร่องทางการได้ยิน จะมีปัญหาในการไม่ได้ยินเสียงน้ำไหล และหากเกิดพฤติกรรมที่
            <br />                  ลืมปิดน้ำบ่อยครั้ง จะทำให้ค่าน้ำปะปาของโรงเรียนเพิ่มสูงขึ้นตามมา
            <br />                            โรงเรียนโสตศึกษาจังหวัดนนทบุรี มีนักเรียนที่บกพร่องทางการได้ยิน และบกพร่องทางสติปัญญานักเรียนส่วนใหญ่
            <br />                  เป็นนักเรียนประจำพักอยู่ที่เรือนนอนภายในโรงเรียน ปัญหาที่พบได้บ่อย คือนักเรียนที่เข้าห้องน้ำมักจะลืมปิดน้ำเมื่อใช้
            <br />                  แล้วโดยเฉพาะนักเรียนที่มีความบกพร่องทางการได้ยิน จะมีปัญหาในการไม่ได้ยินเสียงน้ำไหล และหากเกิดพฤติกรรมที่
            <br />                  ลืมปิดน้ำบ่อยครั้ง จะทำให้ค่าน้ำปะปาของโรงเรียนเพิ่มสูงขึ้นตามมา
            <br />                            โรงเรียนโสตศึกษาจังหวัดนนทบุรี มีนักเรียนที่บกพร่องทางการได้ยิน และบกพร่องทางสติปัญญานักเรียนส่วนใหญ่
            <br />                  เป็นนักเรียนประจำพักอยู่ที่เรือนนอนภายในโรงเรียน ปัญหาที่พบได้บ่อย คือนักเรียนที่เข้าห้องน้ำมักจะลืมปิดน้ำเมื่อใช้
            <br />                  แล้วโดยเฉพาะนักเรียนที่มีความบกพร่องทางการได้ยิน จะมีปัญหาในการไม่ได้ยินเสียงน้ำไหล และหากเกิดพฤติกรรมที่
            <br />                  ลืมปิดน้ำบ่อยครั้ง จะทำให้ค่าน้ำปะปาของโรงเรียนเพิ่มสูงขึ้นตามมา
        </pre>
        
    </div>
  )
}

export default Table1
