import React from 'react'

const Tests = () => {
  var windowww;
  var dataprint = 
    <pre class="fonts">
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
1.	เดือนมกราคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 31 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 345 ราย
2.	เดือนกุมภาพันธ์ 2566 พบเด็กสงสัยพัฒนาการล่าช้า 38 ราย พัฒนาการช้า 7 ราย จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 310 ราย
3.	   3. เดือนมีนาคม 2566 พบเด็กสงสัยพัฒนาการล่าช้า 37 ราย พัฒนาการช้า 6 ราย
4.	       จำนวนเด็กที่มารับการคัดกรองพัฒนากรทั้งหมด 339 ราย
5.	
ความก้าวหน้าของโครงการไตรมาสที่   2                  50     %
</pre>
  const display = () => {
    windowww = window.open("", "", "width=300,height=300");
    windowww.print()
  } 
  return (
    <div>
      <h1>TestPage</h1><br />
      <button onClick={e => display()}>open</button>
      
    </div>
  )
}

export default Tests
